{
  "id": "constitution-1987",
  "type": "statute",
  "title": "1987 Constitution of the Republic of the Philippines",
  "title_en": "1987 Constitution of the Republic of the Philippines",
  "short_name": "1987 Constitution",
  "status": "in_force",
  "issued_date": "1987-02-02",
  "in_force_date": "1987-02-02",
  "url": "https://lawphil.net/consti/cons1987.html",
  "description": "Supreme law of the Philippines; Article III (Bill of Rights) protects privacy of communication and correspondence (Sec. 3), due process (Sec. 1), and freedom of expression (Sec. 4)",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "For purposes of the election of Members of the House of Representatives of the First Congress of the Philippines under the Constitution proposed by the 1986 Constitutional Commission and subsequent el",
      "content": "Section 1. For purposes of the election of Members of the House of Representatives of the First Congress of the Philippines under the Constitution proposed by the 1986 Constitutional Commission and subsequent elections, and until otherwise provided by law, the Members thereof shall be elected from legislative districts apportioned among the provinces, cities, and the Metropolitan Manila Area as follows:\nMetropolitan Manila Area\nMANILA, six (6) -\nFirst District: Barangays Nos.1-146,\nN-City Boundary between Manila and Caloocan;\nE - From Estero de Sunog Apog going South to Estero de Vitas up to the bridge spanning Juan Luna Street, eastward to Tayuman Street up to the Railroad Tracks along Dagupan Street,thence southward to Claro M. Recto Avenue;\nSE - From point Claro M. Recto Avenue extending westward to Manila Bay;\nW - Manila Bay northward to City boundary between Manila and Caloocan.\nSecond District: Barangays Nos. 147-267,\nN - City boundary between Manila and Caloocan;\nE - From end of Rizal Avenue Extension extending southward to Railroad Tracks at Antipolo Street; from corner Antipolo Street and Rizal Avenue on southern side of Railroad Tracks extending westward to Estero de San Lazaro, southward along Estero de San Lazaro up to corner of C. M. Recto Avenue westward to bridge spanning Claro M. Recto at Estero de la Reina;\nW - Estero de la Reina to Estero de Vitas to Estero Sunog Apog to City boundary between Manila and Caloocan;\nThird District: Barangays Nos. 268-394,\nN - City boundary between Manila and Caloocan;\nE - A. Bonifacio Street extending southward to Dimasalang, to Anda-lucia, Claro M. Recto Avenue eastward to Estero de San Miguel ending at Pasig River;\nS - Mouth of Estero de San Miguel at Pasig River, westward to Del Pan Bridge, thence to Del Pan Street;\nW - Del Pan Street northward up to Claro M. Recto Extension to Estero de San Lazaro, northward to Antipolo Street, eastward to Rizal Avenue Extension, northward to boundary between Manila and Caloocan;\nFourth District: Barangays Nos. 395 - 586,\nSW - Estero de San Miguel up to Mendiola Bridge, thence to C. M. Recto Avenue to Quezon Boulevard;\nW - Quezon Boulevard, Andalucia, Dimasalang up to boundary between Manila and Quezon City; NE - City boundary between Manila and Quezon City up to Ramon Magsaysay Boulevard; SE - Ramon Magsaysay Boulevard up to V. Mapa Street;\nS - Ramon Magsaysay Boulevard up to point Estero de San Miguel where Ramon Magsaysay Boulevard spans Estero de San Miguel;\nFifth District: Barangays Nos. 649-828,\nN - Mouth of Pasig River inland to point Paz M. Guanzon Street extending to Estero de Pandacan;\nNE - Estero de Pandacan up to Pedro Gil Street to Tejeron Street up to boundary of Manila and Makati;\nSE - City boundary between Manila and Makati up to Estero de Tripa de Gallina;\nS - City boundary between Pasay and Manila down to Roxas Boulevard up to edge of reclaimed areas westward to Manila Bay;\nW - Manila Bay up to mouth of Pasig River,\nSixth District: Barangays Nos. 587-648; and 829-905\nN - Starting from point which is mouth of Estero de San Miguel going eastward to Mendiola Bridge, following line along Estero de San Miguel up to point where Ramon Magsaysay Boulevard eastward to City boundary between Manila and Quezon Cityl;\nNE - City boundary up to point city boundary of Manila, San Juan and Quezon City;\nE - Manila-San Juan-Mandaluyong-Makati boundaries up to Tejeron Street;\nSE - Tejeron Street to Pedro Gil Street up to bridge spanning Estero de Pandacan;\nSW & W - Estero de Pandacan going northward to Paz M. Guanzon Street, then northward on Paz M. Guazon Street up to Pasig River to mouth of Estero de San Miguel on Pasig River.\nQUEZON CITY, four (4)\nFirst District :\nBarangays Del Monte,Paltok,Bungad,San Antonio,Katipunan,Veterans Village,Talayan,Damayan,Mariblo,Paraiso,Sta. Cruz,Nayong Kanluran,Philam,West Triangle,N.S. Amoranto,San Isidro Labrador,Sta. Teresita,Salvacion,Maharlika,St. Peter,Lourdes,Sto. Domingo,Sienna,San Jose,Manresa,Pag-ibig sa Nayon,Balingasa,Masambong,Damar,Bahay Toro,St. Cristo,Ramon Magsaysay,Project 6,Vasra, Alicia,and Bagong Pag-asa;Second District:\nBarangays Fairview,New Era,Holy Spirit,Batasan Hills,Commonwealth,Payatas,Bagong Silangan,Sauyo,Talipapa,Bagbag,San Bartolome,Sta. Lucia,Gulod,Novaliches Proper,San Agustin,Nagkaisang Nayon,Sta. Monica,Kaligayahan,Pasong Putik,Apolonio Samson,Unang Sigaw,Tandang Sora,Pasong Tamo,Culiat,Baesa,Capri,Balumbato, andSangandaan:Third District :\nBarangays E. Rodriguez,Silangan,Quirino 3-A,Duyan-Duyan,Quirino 3-B,Amihan,Socorro,San Roque,Manga,Zobel Dioquino,Tagumpay,Aguinaldo, Escopa 1,Escopa 2,Escopa 3,Escopa 4,West Kamias,East Kamias,Quirino 2 A,Quririno 2 B,Quirino 2 C,Ugong Norte,Bagumbayan, Libis,Villa Maria Clara,Masagana,Milagrosa,Marilag,Bagumbayan,Loyola Heights,Pansol, andMatandang Balara;Fourth District:\nBarangays Bagong Lipunan,Kaunlaran,San Martin,Immaculate Concepcion,South Triangle,Sacred Heart,Laging Handa,Paligsahan,Obrero,Roxas, Kamuning,Kanluran,Kamuning Silangan,Tatalon,Don Manuel,Dona Josefa,San Isidro,Dona Aurora,Santo Nino,Santol,Dona Imelda,Kristong Hari,Kalusugan,Damayang Lagi,Mariana,Valencia,Horseshoe,Pinagkaisahan,San Vicente,U.P. Campus,Krus Na Ligas,Central,Old Capital Site,U.P. Village,Teacher's East,Teacher's West,Sikatuna,Malaya,Pinahan, andBotocanCALOOCAN CITY, two (2) -\nFirst District : 70 Barangays;\nAll of Caloocan North EDSA;\nSecond District: 118 Barangays;All of Caloocan South EDSA.\nPASAY CITY, one (1)\nMALABON and NAVOTAS, one (1)\nSAN JUAN and MANDALUYONG, one (1)\nMARIKINA, one (1)\nMAKATI, one (1)\nPASIG, one (1) PARANAQUE, one (1)\nLAS PINAS and MUNTINGLUPA, one (1)\nPATEROS and TAGUIG, one (1)\nVALENZUELA, one (1)\nMEMBERS OF THE CONSTITUTIONAL COMMISSION [CON COM]\nWHICH DRAFTED THE\n1987 CONSTITUTION OF THE PHILIPPINES\nPresident: Cecilia Munoz PalmaVice-President: Ambrosio B. PadillaFloor Leader: Napoleon G. RamaAssistant Floor Leaders: Ahmad Domocao Alonto: Jose D. CalderonYusuf R. AbubakarFelicitas S. AquinoAdolfo S. AzcunaTeodoro C. BacaniJose F. S. Bengzon, Jr.Ponciano L. BennagenJoaquin G. BernasFlorangel Rosario BraidCrispino M. de CastroJose C. ColaycoRoberto R. ConcepcionHilario G. Davide, Jr.Vicente B. FozEdmundo G. GarciaJose Luis Martin C. GasconSerafin V.C. GuingonaAlberto M. K. JamirJose B. Laurel, Jr.Eulogio R. LerumRegalado E. MaambongChristian S. MonsodTeodulo C. NatividadMa. Teresa F. NievaJose N. NolledoBlas F. OpleMinda Luz M. QuesadaFlorenz D. RegaladoRustico F. de los Reyes, Jr.Cirilo A. RigosFrancisco A. RodrigoRicardo J. RomuloDecoroso R. RosalesRene V. SarmientoJose E. SuarezLorenzo M. SumulongJaime S. L. TadeoChristine O. TanGregorio J. TingsonEfrain B. TrenasLugum L. UkaWilfrido V. VillacortaBernardo M. VillegasAttested by :\nFlerida Ruth P. Romero\nSecretary-General\nThe Lawphil Project - Arellano Law Foundation"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "The Commission on Elections shall exercise the following powers and functions:",
      "content": "Section 2. The Commission on Elections shall exercise the following powers and functions:\nEnforce and administer all laws and regulations relative to the conduct of an election, plebiscite, initiative, referendum, and recall.\nExercise exclusive original jurisdiction over all contests relating to the elections, returns, and qualifications of all elective regional, provincial, and city officials, and appellate jurisdiction over all contests involving elective municipal officials decided by trial courts of general jurisdiction, or involving elective barangay officials decided by trial courts of limited jurisdiction.\nDecisions, final orders, or rulings of the Commission on election contests involving elective municipal and barangay offices shall be final, executory, and not appealable.\nDecide, except those involving the right to vote, all questions affecting elections, including determination of the number and location of polling places, appointment of election officials and inspectors, and registration of voters.\nDeputize, with the concurrence of the President, law enforcement agencies and instrumentalities of the Government, including the Armed Forces of the Philippines, for the exclusive purpose of ensuring free, orderly, honest, peaceful, and credible elections.\nRegister, after sufficient publication, political parties, organizations, or coalitions which, in addition to other requirements, must present their platform or program of government; and accredit citizens' arms of the Commission on Elections. Religious denominations and sects shall not be registered. Those which seek to achieve their goals through violence or unlawful means, or refuse to uphold and adhere to this Constitution, or which are supported by any foreign government shall likewise be refused registration.\nFinancial contributions from foreign governments and their agencies to political parties, organizations, coalitions, or candidates related to elections, constitute interference in national affairs, and, when accepted, shall be an additional ground for the cancellation of their registration with the Commission, in addition to other penalties that may be prescribed by law.\nFile, upon a verified complaint, or on its own initiative, petitions in court for inclusion or exclusion of voters; investigate and, where appropriate, prosecute cases of violations of election laws, including acts or omissions constituting election frauds, offenses, and malpractices.\nRecommend to the Congress effective measures to minimize election spending, including limitation of places where propaganda materials shall be posted, and to prevent and penalize all forms of election frauds, offenses, malpractices, and nuisance candidacies.\nRecommend to the President the removal of any officer or employee it has deputized, or the imposition of any other disciplinary action, for violation or disregard of, or disobedience to, its directive, order, or decision.\nSubmit to the President and the Congress, a comprehensive report on the conduct of each election, plebiscite, initiative, referendum, or recall."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "",
      "content": "Section 3.\nThe House of Representatives shall have the exclusive power to initiate all cases of impeachment.\nA verified complaint for impeachment may be filed by any Member of the House of Representatives or by any citizen upon a resolution or endorsement by any Member thereof, which shall be included in the Order of Business within ten session days, and referred to the proper Committee within three session days thereafter. The Committee, after hearing, and by a majority vote of all its Members, shall submit its report to the House within sixty session days from such referral, together with the corresponding resolution. The resolution shall be calendared for consideration by the House within ten session days from receipt thereof.\nA vote of at least one-third of all the Members of the House shall be necessary either to affirm a favorable resolution with the Articles of Impeachment of the Committee, or override its contrary resolution. The vote of each Member shall be recorded.\nIn case the verified complaint or resolution of impeachment is filed by at least one-third of all the Members of the House, the same shall constitute the Articles of Impeachment, and trial by the Senate shall forthwith proceed.\nNo impeachment proceedings shall be initiated against the same official more than once within a period of one year.\nThe Senate shall have the sole power to try and decide all cases of impeachment. When sitting for that purpose, the Senators shall be on oath or affirmation. When the President of the Philippines is on trial, the Chief Justice of the Supreme Court shall preside, but shall not vote. No person shall be convicted without the concurrence of two-thirds of all the Members of the Senate.\nJudgment in cases of impeachment shall not extend further than removal from office and disqualification to hold any office under the Republic of the Philippines, but the party convicted shall nevertheless be liable and subject to prosecution, trial, and punishment, according to law.\nThe Congress shall promulgate its rules on impeachment to effectively carry out the purpose of this section."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "The President and the Vice-President shall be elected by direct vote of the people for a term of six years which shall begin at noon on the thirtieth day of June next following the day of the election and shall end at noon of the same date, six years thereafter",
      "content": "Section 4. The President and the Vice-President shall be elected by direct vote of the people for a term of six years which shall begin at noon on the thirtieth day of June next following the day of the election and shall end at noon of the same date, six years thereafter. The President shall not be eligible for any re-election. No person who has succeeded as President and has served as such for more than four years shall be qualified for election to the same office at any time.\nNo Vice-President shall serve for more than two successive terms. Voluntary renunciation of the office for any length of time shall not be considered as an interruption in the continuity of the service for the full term for which he was elected.\nUnless otherwise provided by law, the regular election for President and Vice-President shall be held on the second Monday of May.\nThe returns of every election for President and Vice-President, duly certified by the board of canvassers of each province or city, shall be transmitted to the Congress, directed to the President of the Senate. Upon receipt of the certificates of canvass, the President of the Senate shall, not later than thirty days after the day of the election, open all the certificates in the presence of the Senate and the House of Representatives in joint public session, and the Congress, upon determination of the authenticity and due execution thereof in the manner provided by law, canvass the votes.\nThe person having the highest number of votes shall be proclaimed elected, but in case two or more shall have an equal and highest number of votes, one of them shall forthwith be chosen by the vote of a majority of all the Members of both Houses of the Congress, voting separately.\nThe Congress shall promulgate its rules for the canvassing of the certificates.\nThe Supreme Court, sitting en banc, shall be the sole judge of all contests relating to the election, returns, and qualifications of the President or Vice-President, and may promulgate its rules for the purpose."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "The Supreme Court shall have the following powers:",
      "content": "Section 5. The Supreme Court shall have the following powers:\nExercise original jurisdiction over cases affecting ambassadors, other public ministers and consuls, and over petitions for certiorari, prohibition, mandamus, quo warranto, and habeas corpus.\nReview, revise, reverse, modify, or affirm on appeal or certiorari, as the law or the Rules of Court may provide, final judgments and orders of lower courts in:\nAll cases in which the constitutionality or validity of any treaty, international or executive agreement, law, presidential decree, proclamation, order, instruction, ordinance, or regulation is in question.\nAll cases involving the legality of any tax, impost, assessment, or toll, or any penalty imposed in relation thereto.\nAll cases in which the jurisdiction of any lower court is in issue.\nAll criminal cases in which the penalty imposed is reclusion perpetua or higher.\nAll cases in which only an error or question of law is involved.\nAssign temporarily judges of lower courts to other stations as public interest may require. Such temporary assignment shall not exceed six months without the consent of the judge concerned.\nOrder a change of venue or place of trial to avoid a miscarriage of justice.\nPromulgate rules concerning the protection and enforcement of constitutional rights, pleading, practice, and procedure in all courts, the admission to the practice of law, the integrated bar, and legal assistance to the under-privileged. Such rules shall provide a simplified and inexpensive procedure for the speedy disposition of cases, shall be uniform for all courts of the same grade, and shall not diminish, increase, or modify substantive rights. Rules of procedure of special courts and quasi-judicial bodies shall remain effective unless disapproved by the Supreme Court.\nAppoint all officials and employees of the Judiciary in accordance with the Civil Service Law."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "The State shall apply the principles of agrarian reform or stewardship, whenever applicable in accordance with law, in the disposition or utilization of other natural resources, including lands of the public domain under lease or concession suitable to agriculture, subject to prior rights, homestead rights of small settlers, and the rights of indigenous communities to their ancestral lands",
      "content": "Section 6. The State shall apply the principles of agrarian reform or stewardship, whenever applicable in accordance with law, in the disposition or utilization of other natural resources, including lands of the public domain under lease or concession suitable to agriculture, subject to prior rights, homestead rights of small settlers, and the rights of indigenous communities to their ancestral lands. The State may resettle landless farmers and farmworkers in its own agricultural estates which shall be distributed to them in the manner provided by law."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "The President-elect and the Vice President-elect shall assume office at the beginning of their terms",
      "content": "Section 7. The President-elect and the Vice President-elect shall assume office at the beginning of their terms.\nIf the President-elect fails to qualify, the Vice President-elect shall act as President until the President-elect shall have qualified.\nIf a President shall not have been chosen, the Vice President-elect shall act as President until a President shall have been chosen and qualified.\nIf at the beginning of the term of the President, the President-elect shall have died or shall have become permanently disabled, the Vice President-elect shall become President.\nWhere no President and Vice-President shall have been chosen or shall have qualified, or where both shall have died or become permanently disabled, the President of the Senate or, in case of his inability, the Speaker of the House of Representatives, shall act as President until a President or a Vice-President shall have been chosen and qualified.\nThe Congress shall, by law, provide for the manner in which one who is to act as President shall be selected until a President or a Vice-President shall have qualified, in case of death, permanent disability, or inability of the officials mentioned in the next preceding paragraph."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "",
      "content": "Section 8.\nA Judicial and Bar Council is hereby created under the supervision of the Supreme Court composed of the Chief Justice as ex officio Chairman, the Secretary of Justice, and a representative of the Congress as ex officio Members, a representative of the Integrated Bar, a professor of law, a retired Member of the Supreme Court, and a representative of the private sector.\nThe regular members of the Council shall be appointed by the President for a term of four years with the consent of the Commission on Appointments. Of the Members first appointed, the representative of the Integrated Bar shall serve for four years, the professor of law for three years, the retired Justice for two years, and the representative of the private sector for one year.\nThe Clerk of the Supreme Court shall be the Secretary ex officio of the Council and shall keep a record of its proceedings.\nThe regular Members of the Council shall receive such emoluments as may be determined by the Supreme Court. The Supreme Court shall provide in its annual budget the appropriations for the Council.\nThe Council shall have the principal function of recommending appointees to the judiciary. It may exercise such other functions and duties as the Supreme Court may assign to it."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "The Congress may establish an independent economic and planning agency headed by the President, which shall, after consultations with the appropriate public agencies, various private sectors, and local government units, recommend to Congress, and implement continuing integrated and coordinated programs and policies for national development",
      "content": "Section 9. The Congress may establish an independent economic and planning agency headed by the President, which shall, after consultations with the appropriate public agencies, various private sectors, and local government units, recommend to Congress, and implement continuing integrated and coordinated programs and policies for national development.\nUntil the Congress provides otherwise, the National Economic and Development Authority shall function as the independent planning agency of the government."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "The Congress shall, at ten o'clock in the morning of the third day after the vacancy in the offices of the President and Vice-President occurs, convene in accordance with its rules without need of a call and within seven days, enact a law calling for a special election to elect a President and a Vice-President to be held not earlier than forty-five days nor later than sixty days from the time of such call",
      "content": "Section 10. The Congress shall, at ten o'clock in the morning of the third day after the vacancy in the offices of the President and Vice-President occurs, convene in accordance with its rules without need of a call and within seven days, enact a law calling for a special election to elect a President and a Vice-President to be held not earlier than forty-five days nor later than sixty days from the time of such call. The bill calling such special election shall be deemed certified under paragraph 2, Section 26, Article V1 of this Constitution and shall become law upon its approval on third reading by the Congress. Appropriations for the special election shall be charged against any current appropriations and shall be exempt from the requirements of paragraph 4, Section 25, Article V1 of this Constitution. The convening of the Congress cannot be suspended nor the special election postponed. No special election shall be called if the vacancy occurs within eighteen months before the date of the next presidential election."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Whenever the President transmits to the President of the Senate and the Speaker of the House of Representatives his written declaration that he is unable to discharge the powers and duties of his office, and until he transmits to them a written declaration to the contrary, such powers and duties shall be discharged by the Vice-President as Acting President",
      "content": "Section 11. Whenever the President transmits to the President of the Senate and the Speaker of the House of Representatives his written declaration that he is unable to discharge the powers and duties of his office, and until he transmits to them a written declaration to the contrary, such powers and duties shall be discharged by the Vice-President as Acting President.\nWhenever a majority of all the Members of the Cabinet transmit to the President of the Senate and to the Speaker of the House of Representatives their written declaration that the President is unable to discharge the powers and duties of his office, the Vice-President shall immediately assume the powers and duties of the office as Acting President.\nThereafter, when the President transmits to the President of the Senate and to the Speaker of the House of Representatives his written declaration that no inability exists, he shall reassume the powers and duties of his office. Meanwhile, should a majority of all the Members of the Cabinet transmit within five days to the President of the Senate and to the Speaker of the House of Representatives, their written declaration that the President is unable to discharge the powers and duties of his office, the Congress shall decide the issue. For that purpose, the Congress shall convene, if it is not in session, within forty-eight hours, in accordance with its rules and without need of call.\nIf the Congress, within ten days after receipt of the last written declaration, or, if not in session, within twelve days after it is required to assemble, determines by a two-thirds vote of both Houses, voting separately, that the President is unable to discharge the powers and duties of his office, the Vice-President shall act as President; otherwise, the President shall continue exercising the powers and duties of his office."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "",
      "content": "Section 12.\nAny person under investigation for the commission of an offense shall have the right to be informed of his right to remain silent and to have competent and independent counsel preferably of his own choice. If the person cannot afford the services of counsel, he must be provided with one. These rights cannot be waived except in writing and in the presence of counsel.\nNo torture, force, violence, threat, intimidation, or any other means which vitiate the free will shall be used against him. Secret detention places, solitary, incommunicado, or other similar forms of detention are prohibited.\nAny confession or admission obtained in violation of this or Section 17 hereof shall be inadmissible in evidence against him.\nThe law shall provide for penal and civil sanctions for violations of this Section as well as compensation to the rehabilitation of victims of torture or similar practices, and their families."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "The Office of the Ombudsman shall have the following powers, functions, and duties:",
      "content": "Section 13. The Office of the Ombudsman shall have the following powers, functions, and duties:\nInvestigate on its own, or on complaint by any person, any act or omission of any public official, employee, office or agency, when such act or omission appears to be illegal, unjust, improper, or inefficient.\nDirect, upon complaint or at its own instance, any public official or employee of the Government, or any subdivision, agency or instrumentality thereof, as well as of any government-owned or controlled corporation with original charter, to perform and expedite any act or duty required by law, or to stop, prevent, and correct any abuse or impropriety in the performance of duties.\nDirect the officer concerned to take appropriate action against a public official or employee at fault, and recommend his removal, suspension, demotion, fine, censure, or prosecution, and ensure compliance therewith.\nDirect the officer concerned, in any appropriate case, and subject to such limitations as may be provided by law, to furnish it with copies of documents relating to contracts or transactions entered into by his office involving the disbursement or use of public funds or properties, and report any irregularity to the Commission on Audit for appropriate action.\nRequest any government agency for assistance and information necessary in the discharge of its responsibilities, and to examine, if necessary, pertinent records and documents.\nPublicize matters covered by its investigation when circumstances so warrant and with due prudence.\nDetermine the causes of inefficiency, red tape, mismanagement, fraud, and corruption in the Government and make recommendations for their elimination and the observance of high standards of ethics and efficiency.\nPromulgate its rules of procedure and exercise such other powers or perform such functions or duties as may be provided by law."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "",
      "content": "Section 14.No person shall be held to answer for a criminal offense without due process of law.\nIn all criminal prosecutions, the accused shall be presumed innocent until the contrary is proved, and shall enjoy the right to be heard by himself and counsel, to be informed of the nature and cause of the accusation against him, to have a speedy, impartial, and public trial, to meet the witnesses face to face, and to have compulsory process to secure the attendance of witnesses and the production of evidence in his behalf. However, after arraignment, trial may proceed notwithstanding the absence of the accused: Provided, that he has been duly notified and his failure to appear is unjustifiable."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "",
      "content": "Section 15.\nAll cases or matters filed after the effectivity of this Constitution must be decided or resolved within twenty-four months from date of submission for the Supreme Court, and, unless reduced by the Supreme Court, twelve months for all lower collegiate courts, and three months for all other lower courts.\nA case or matter shall be deemed submitted for decision or resolution upon the filing of the last pleading, brief, or memorandum required by the Rules of Court or by the court itself.\nUpon the expiration of the corresponding period, a certification to this effect signed by the Chief Justice or the presiding judge shall forthwith be issued and a copy thereof attached to the record of the case or matter, and served upon the parties. The certification shall state why a decision or resolution has not been rendered or issued within said period.\nDespite the expiration of the applicable mandatory period, the court, without prejudice to such responsibility as may have been incurred in consequence thereof, shall decide or resolve the case or matter submitted thereto for determination, without further delay."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "",
      "content": "Section 16.\nThe Senate shall elect its President and the House of Representatives, its Speaker, by a majority vote of all its respective Members. Each House shall choose such other officers as it may deem necessary.\nA majority of each House shall constitute a quorum to do business, but a smaller number may adjourn from day to day and may compel the attendance of absent Members in such manner, and under such penalties, as such House may provide.\nEach House may determine the rules of its proceedings, punish its Members for disorderly behavior, and, with the concurrence of two-thirds of all its Members, suspend or expel a Member. A penalty of suspension, when imposed, shall not exceed sixty days.\nEach House shall keep a Journal of its proceedings, and from time to time publish the same, excepting such parts as may, in its judgment, affect national security; and the yeas and nays on any question shall, at the request of one-fifth of the Members present, be entered in the Journal. Each House shall also keep a Record of its proceedings.\nNeither House during the sessions of the Congress shall, without the consent of the other, adjourn for more than three days, nor to any other place than that in which the two Houses shall be sitting."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "The Senate and the House of Representatives shall each have an Electoral Tribunal which shall be the sole judge of all contests relating to the election, returns, and qualifications of their respective Members",
      "content": "Section 17. The Senate and the House of Representatives shall each have an Electoral Tribunal which shall be the sole judge of all contests relating to the election, returns, and qualifications of their respective Members. Each Electoral Tribunal shall be composed of nine Members, three of whom shall be Justices of the Supreme Court to be designated by the Chief Justice, and the remaining six shall be Members of the Senate or the House of Representatives, as the case may be, who shall be chosen on the basis of proportional representation from the political parties and the parties or organizations registered under the party-list system represented therein. The senior Justice in the Electoral Tribunal shall be its Chairman."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "The President shall be the Commander-in-Chief of all armed forces of the Philippines and whenever it becomes necessary, he may call out such armed forces to prevent or suppress lawless violence, invasion or rebellion",
      "content": "Section 18. The President shall be the Commander-in-Chief of all armed forces of the Philippines and whenever it becomes necessary, he may call out such armed forces to prevent or suppress lawless violence, invasion or rebellion. In case of invasion or rebellion, when the public safety requires it, he may, for a period not exceeding sixty days, suspend the privilege of the writ of habeas corpus or place the Philippines or any part thereof under martial law. Within forty-eight hours from the proclamation of martial law or the suspension of the privilege of the writ of habeas corpus, the President shall submit a report in person or in writing to the Congress. The Congress, voting jointly, by a vote of at least a majority of all its Members in regular or special session, may revoke such proclamation or suspension, which revocation shall not be set aside by the President. Upon the initiative of the President, the Congress may, in the same manner, extend such proclamation or suspension for a period to be determined by the Congress, if the invasion or rebellion shall persist and public safety requires it.\nThe Congress, if not in session, shall, within twenty-four hours following such proclamation or suspension, convene in accordance with its rules without need of a call.\nThe Supreme Court may review, in an appropriate proceeding filed by any citizen, the sufficiency of the factual basis of the proclamation of martial law or the suspension of the privilege of the writ or the extension thereof, and must promulgate its decision thereon within thirty days from its filing.\nA state of martial law does not suspend the operation of the Constitution, nor supplant the functioning of the civil courts or legislative assemblies, nor authorize the conferment of jurisdiction on military courts and agencies over civilians where civil courts are able to function, nor automatically suspend the privilege of the writ.\nThe suspension of the privilege of the writ shall apply only to persons judicially charged for rebellion or offenses inherent in or directly connected with invasion.\nDuring the suspension of the privilege of the writ, any person thus arrested or detained shall be judicially charged within three days, otherwise he shall be released."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "",
      "content": "Section 19.\nExcessive fines shall not be imposed, nor cruel, degrading or inhuman punishment inflicted. Neither shall death penalty be imposed, unless, for compelling reasons involving heinous crimes, the Congress hereafter provides for it. Any death penalty already imposed shall be reduced to reclusion perpetua.\nThe employment of physical, psychological, or degrading punishment against any prisoner or detainee or the use of substandard or inadequate penal facilities under subhuman conditions shall be dealt with by law."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "The Congress shall establish an independent central monetary authority, the members of whose governing board must be natural-born Filipino citizens, of known probity, integrity, and patriotism, the majority of whom shall come from the private sector",
      "content": "Section 20. The Congress shall establish an independent central monetary authority, the members of whose governing board must be natural-born Filipino citizens, of known probity, integrity, and patriotism, the majority of whom shall come from the private sector. They shall also be subject to such other qualifications and disabilities as may be prescribed by law. The authority shall provide policy direction in the areas of money, banking, and credit. It shall have supervision over the operations of banks and exercise such regulatory powers as may be provided by law over the operations of finance companies and other institutions performing similar functions.\nUntil the Congress otherwise provides, the Central Bank of the Philippines operating under existing laws, shall function as the central monetary authority."
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "The Congress shall provide efficacious procedures and adequate remedies for the reversion to the State of all lands of the public domain and real rights connected therewith which were acquired in violation of the Constitution or the public land laws, or through corrupt practices",
      "content": "Section 21. The Congress shall provide efficacious procedures and adequate remedies for the reversion to the State of all lands of the public domain and real rights connected therewith which were acquired in violation of the Constitution or the public land laws, or through corrupt practices. No transfer or disposition of such lands or real rights shall be allowed until after the lapse of one year from the ratification of this Constitution."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "The heads of departments may, upon their own initiative, with the consent of the President, or upon the request of either House, as the rules of each House shall provide, appear before and be heard by such House on any matter pertaining to their departments",
      "content": "Section 22. The heads of departments may, upon their own initiative, with the consent of the President, or upon the request of either House, as the rules of each House shall provide, appear before and be heard by such House on any matter pertaining to their departments. Written questions shall be submitted to the President of the Senate or the Speaker of the House of Representatives at least three days before their scheduled appearance. Interpellations shall not be limited to written questions, but may cover matters related thereto. When the security of the State or the public interest so requires and the President so states in writing, the appearance shall be conducted in executive session."
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "",
      "content": "Section 23.\nThe Congress, by a vote of two-thirds of both Houses in joint session assembled, voting separately, shall have the sole power to declare the existence of a state of war.\nIn times of war or other national emergency, the Congress may, by law, authorize the President, for a limited period and subject to such restrictions as it may prescribe, to exercise powers necessary and proper to carry out a declared national policy. Unless sooner withdrawn by resolution of the Congress, such powers shall cease upon the next adjournment thereof."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Private armies and other armed groups not recognized by duly constituted authority shall be dismantled",
      "content": "Section 24. Private armies and other armed groups not recognized by duly constituted authority shall be dismantled. All paramilitary forces including Civilian Home Defense Forces not consistent with the citizen armed force established in this Constitution, shall be dissolved or, where appropriate, converted into the regular force."
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "",
      "content": "Section 25.\nThe Congress may not increase the appropriations recommended by the President for the operation of the Government as specified in the budget. The form, content, and manner of preparation of the budget shall be prescribed by law.\nNo provision or enactment shall be embraced in the general appropriations bill unless it relates specifically to some particular appropriation therein. Any such provision or enactment shall be limited in its operation to the appropriation to which it relates.\nThe procedure in approving appropriations for the Congress shall strictly follow the procedure for approving appropriations for other departments and agencies.\nA special appropriations bill shall specify the purpose for which it is intended, and shall be supported by funds actually available as certified by the National Treasurer, or to be raised by a corresponding revenue proposal therein.\nNo law shall be passed authorizing any transfer of appropriations; however, the President, the President of the Senate, the Speaker of the House of Representatives, the Chief Justice of the Supreme Court, and the heads of Constitutional Commissions may, by law, be authorized to augment any item in the general appropriations law for their respective offices from savings in other items of their respective appropriations.\nDiscretionary funds appropriated for particular officials shall be disbursed only for public purposes to be supported by appropriate vouchers and subject to such guidelines as may be prescribed by law.\nIf, by the end of any fiscal year, the Congress shall have failed to pass the general appropriations bill for the ensuing fiscal year, the general appropriations law for the preceding fiscal year shall be deemed re-enacted and shall remain in force and effect until the general appropriations bill is passed by the Congress."
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "The authority to issue sequestration or freeze orders under Proclamation No",
      "content": "Section 26. The authority to issue sequestration or freeze orders under Proclamation No. 3 dated March 25, 1986 in relation to the recovery of ill-gotten wealth shall remain operative for not more than eighteen months after the ratification of this Constitution. However, in the national interest, as certified by the President, the Congress may extend such period.\nA sequestration or freeze order shall be issued only upon showing of a prima facie case. The order and the list of the sequestered or frozen properties shall forthwith be registered with the proper court. For orders issued before the ratification of this Constitution, the corresponding judicial action or proceeding shall be filed within six months from its ratification. For those issued after such ratification, the judicial action or proceeding shall be commenced within six months from the issuance thereof.\nThe sequestration or freeze order is deemed automatically lifted if no judicial action or proceeding is commenced as herein provided."
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "This Constitution shall take effect immediately upon its ratification by a majority of the votes cast in a plebiscite held for the purpose and shall supersede all previous Constitutions",
      "content": "Section 27. This Constitution shall take effect immediately upon its ratification by a majority of the votes cast in a plebiscite held for the purpose and shall supersede all previous Constitutions.\nThe foregoing proposed Constitution of the Republic of the Philippines was approved by the Constitutional Commission of 1986 on the twelfth day of October, Nineteen hundred and eighty-six, and accordingly signed on the fifteenth day of October, Nineteen hundred and eighty-six at the Plenary Hall, National Government Center, Quezon City, by the Commissioners whose signatures are hereunder affixed.\nAdopted:\nPresident: Cecilia Munoz PalmaVice-President: Ambrosio B. PadillaFloor Leader: Napoleon G. RamaAssistant Floor Leaders: Ahmad Domocao Alonto: Jose D. CalderonYusuf R. AbubakarFelicitas S. AquinoAdolfo S. AzcunaTeodoro C. BacaniJose F. S. Bengzon, Jr.Ponciano L. BennagenJoaquin G. BernasFlorangel Rosario BraidCrispino M. de CastroJose C. ColaycoRoberto R. ConcepcionHilario G. Davide, Jr.Vicente B. FozEdmundo G. GarciaJose Luis Martin C. GasconSerafin V.C. GuingonaAlberto M. K. JamirJose B. Laurel, Jr.Eulogio R. LerumRegalado E. MaambongChristian S. MonsodTeodulo C. NatividadMa. Teresa F. NievaJose N. NolledoBlas F. OpleMinda Luz M. QuesadaFlorenz D. RegaladoRustico F. de los Reyes, Jr.Cirilo A. RigosFrancisco A. RodrigoRicardo J. RomuloDecoroso R. RosalesRene V. SarmientoJose E. SuarezLorenzo M. SumulongJaime S. L. TadeoChristine O. TanGregorio J. TingsonEfrain B. TrenasLugum L. UkaWilfrido V. VillacortaBernardo M. VillegasAttested by :\nFlerida Ruth P. Romero\nSecretary-General\nORDINANCEAPPORTIONING THE SEATS OF THE HOUSE OF REPRESENTATIVES\nOF THE CONGRESS OF THE PHILIPPINES TO THE DIFFERENT LEGISLATIVE DISTRICTS\nIN PROVINCES AND CITIES ANDTHE METROPOLITAN MANILA AREA"
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "",
      "content": "Section 28.\nThe rule of taxation shall be uniform and equitable. The Congress shall evolve a progressive system of taxation.\nThe Congress may, by law, authorize the President to fix within specified limits, and subject to such limitations and restrictions as it may impose, tariff rates, import and export quotas, tonnage and wharfage dues, and other duties or imposts within the framework of the national development program of the Government.\nCharitable institutions, churches and personages or convents appurtenant thereto, mosques, non-profit cemeteries, and all lands, buildings, and improvements, actually, directly, and exclusively used for religious, charitable, or educational purposes shall be exempt from taxation.\nNo law granting any tax exemption shall be passed without the concurrence of a majority of all the Members of the Congress."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "",
      "content": "Section 29.\nNo money shall be paid out of the Treasury except in pursuance of an appropriation made by law.\nNo public money or property shall be appropriated, applied, paid, or employed, directly or indirectly, for the use, benefit, or support of any sect, church, denomination, sectarian institution, or system of religion, or of any priest, preacher, minister, other religious teacher, or dignitary as such, except when such priest, preacher, minister, or dignitary is assigned to the armed forces, or to any penal institution, or government orphanage or leprosarium.\nAll money collected on any tax levied for a special purpose shall be treated as a special fund and paid out for such purpose only. If the purpose for which a special fund was created has been fulfilled or abandoned, the balance, if any, shall be transferred to the general funds of the Government."
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "No law shall be passed increasing the appellate jurisdiction of the Supreme Court as provided in this Constitution without its advice and concurrence",
      "content": "Section 30. No law shall be passed increasing the appellate jurisdiction of the Supreme Court as provided in this Constitution without its advice and concurrence."
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "No law granting a title of royalty or nobility shall be enacted",
      "content": "Section 31. No law granting a title of royalty or nobility shall be enacted."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "The Congress shall, as early as possible, provide for a system of initiative and referendum, and the exceptions therefrom, whereby the people can directly propose and enact laws or approve or reject any act or law or part thereof passed by the Congress or local legislative body after the registration of a petition therefor signed by at least ten per centum of the total number of registered voters, of which every legislative district must be represented by at least three per centum of the registered voters thereof",
      "content": "Section 32. The Congress shall, as early as possible, provide for a system of initiative and referendum, and the exceptions therefrom, whereby the people can directly propose and enact laws or approve or reject any act or law or part thereof passed by the Congress or local legislative body after the registration of a petition therefor signed by at least ten per centum of the total number of registered voters, of which every legislative district must be represented by at least three per centum of the registered voters thereof.\nARTICLE VII\nEXECUTIVE DEPARTMENT"
    }
  ],
  "definitions": []
}