{
  "id": "ra-8484-access-devices-regulation",
  "type": "statute",
  "title": "Access Devices Regulation Act of 1998",
  "title_en": "Access Devices Regulation Act of 1998",
  "short_name": "RA 8484",
  "status": "in_force",
  "issued_date": "1998-02-11",
  "in_force_date": "1998-02-11",
  "url": "https://lawphil.net/statutes/repacts/ra1998/ra_8484_1998.html",
  "description": "Regulates access devices (credit cards, debit cards, account numbers); penalises fraud, counterfeiting, and unauthorised use of access devices",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Short title",
      "content": "Section 1. Short title. &#8211; This Act shall be known as the \" Access Devices Regulation Act of 1998. \""
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Declaration of policy",
      "content": "Section 2. Declaration of policy. &#8211; The State recognizes the recent advances in technology and the widespread use of access devices in commercial transactions. Toward this end, the State shall protect the rights and define the liabilities of parties in such commercial transactions by regulating the issuance and use of access devices."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Definition of terms",
      "content": "Section 3. Definition of terms. &#8211; For purposes of this Act, the terms:\n(a) Access Device &#8211; means any card, plate, code, account number, electronic serial number, personal identification number, or other telecommunications service, equipment, or instrumental identifier, or other means of account access that can be used to obtain money, good, services, or any other thing of value or to initiate a transfer of funds (other than a transfer originated solely by paper instrument);\n(b) Counterfeit Access Device &#8211; means any access device that is counterfeit, fictitious, altered, or forged, or an identifiable component of an access device or counterfeit access device;\n(c) Unauthorized Access Device &#8211; means any access device that is stolen, lost, expired, revoked, canceled, suspended, or obtained with intent to defraud;\n(d) Access Device Fraudulently Applied for &#8211; means any access device that was applied for or issued on account of the use of falsified document, false information, fictitious identities and addresses, or any form of false pretense or misrepresentation;\n(e) Consumer &#8211; means a natural person;\n(f) Credit Card &#8211; means any card, plate, coupon book, or other credit device existing for the purpose of obtaining money, goods, property, labor or services or any thing of value on credit;\n(g) Device Making or Altering Equipment &#8211; means any equipment, mechanism or impression designed or primarily used for making or altering or reencoding an access device or a counterfeit access device;\n(h) Finance Charges &#8211; represent the amount to be paid by the debtor incident to the extension of credit such as interest or discounts, collection fees, credit investigation fees, and other service charges;\n(i) Open-end-credit plan &#8211; means a consumer credit extended on an account pursuant to a plan under which:\n1) the creditor may permit the person to make purchase or obtain loans, from time to time, directly from the creditor or indirectly by use of credit card, or other service;\n2) the person has the privilege of paying the balance; or\n3) a finance charge may be computed by the creditor from time to time on an unpaid balance.(j) Penalty Charges &#8211; means such amount, in addition to interest, imposed on the credit card holder for non-payment of an account within a prescribed period;\n(k) Produce &#8211; includes design, alter, authenticate, duplicate or assemble; and\n(l) Trafficking &#8211; means transferring, or otherwise disposing of, to another, or obtaining control of, with intent to transfer or dispose of."
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Credit Card Application and Solicitation",
      "content": "Section 4. Credit Card Application and Solicitation. &#8211; Any application to open a credit card account for any person under an open-end credit plan or a solicitation to open such an account, either by mail, telephone or other means, shall disclose in writing or orally, as the case may be, the following information:\n(a) Annual Percentage Rate\n1) Each annual percentage rate of interest on the amount of credit obtained by the credit card holder under such credit plan. Where an extension of credit is subject to a variable rate, the fact that the rate is variable, and the annual percentage rate in effect at the time of the mailing.\n2) Where more than one rate applies, the range of balances to which each rate applies.(b) Annual and other Fees\n1) Any annual fee, other periodic fee, or membership fee imposed for the issuance or availability of a credit card, including any account maintenance fee or any other charge imposed based on activity or inactivity for the account during the billing cycle.\n2) Any minimum finance charge imposed for each period during which any extension of credit which is subject to a finance charge is outstanding.\n3) Any transaction charge imposed in connection with use of the card to purchase goods or services.\n4) Any fee, penalty or surcharge imposed for the delay in payment of an account.(c) Balance Calculation Method &#8211; the name or a detailed explanation of the balance calculation method used in determining the balance upon which the finance charge is computed.\n(d) Cash Advance Fee &#8211; any fee imposed for an extension of credit in the form of cash.\n(e) Over-the-Limit-Fee &#8211; any fee imposed in connection with an extension of credit in excess of the amount of credit authorized to be extended with respect to such amount: Provided, however, That in case the application or solicitation to open a credit card account for any person under an open-end consumer credit plan be made through catalogs, magazines, or other publications, the following additional information shall be disclosed:\n1) A statement, in a conspicuous and prominent location on the application or solicitation, that:\ni) the information is accurate as of the date the application or solicitation was printed;\nii) the information contained in the application or solicitation is subject to change after such date;\niii) the applicant should contact the creditor for information on any change in the information contained in the application or solicitation since it was printed;\n(2) The date the application or solicitation was printed; and\n(3) In a conspicuous and prominent location on the application or solicitation, a toll free telephone number or mailing address which the applicant may contact to obtain any change in the information provided in the application or solicitation since it was printed."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Computations",
      "content": "Section 5. Computations. &#8211; In addition to the foregoing, a credit card issuer must, to the extent practicable, provide a detailed explanation and a clear illustration of the manner by which all charges and fees are computed."
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Exceptions",
      "content": "Section 6. Exceptions. &#8211; The disclosures required under Section 4 of this Act may be omitted in any telephone solicitation or application if the credit card issuer:\n(a) does not impose any fee in connection with paragraph (b)(1), Section 4 of this Act;\n(b) does not impose any fee in connection with telephone solicitation unless the consumer signifies acceptance by using the card;\n(c) discloses clearly the information described in Section 4 of this Act in writing within thirty (30) days after the consumer requests the card, but in no event later than the date of delivery of the card; and\n(d) discloses clearly that the consumer is not obligated to accept the card or account and the consumer will not be obligated to pay any fees or charges disclosed unless the consumer elects to accept the card or account by using the card."
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Disclosure Prior to Renewal",
      "content": "Section 7. Disclosure Prior to Renewal. &#8211; Except in telephone solicitations a card issuer that imposes any fee described in Section 4 shall transmit to a consumer's credit card account a clear and conspicuous disclosure of:\n(a) the date by which, the month by which, or the billing period at the close of which, the account will expire if not renewed;\n(b) the information described in Section 4 which shall be transmitted to a consumer at least thirty (30) days prior to the scheduled renewal date of the consumer's credit card account;\n(c) the information described in Section 4 (a) (1) which shall be transmitted to a consumer's credit card account; and\n(d) the method by which the consumer may terminate continued credit availability under the account: Provided, That the disclosures required by this section must be made prior to posting a fee described in Section 4 (b) (1) to the account, or with the periodic billing statement first disclosing that the fee has been posted to the account subject to the condition that the consumer is given thirty (30) day period to avoid payment of the fee or to have the fee recredited to the account in any case where the consumer does not wish to continue the availability of the credit."
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Failure to Disclose",
      "content": "Section 8. Failure to Disclose. &#8211; Credit card companies which shall fail to disclose the information required under Sections 4, 5 and 7 of this Act, after due notice and hearing, shall be subject to suspension or cancellation of their authority to issue credit cards by the Bangko Sentral ng Pilipinas, Securities and Exchange Commission and such other government agencies."
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Prohibited Acts",
      "content": "Section 9. Prohibited Acts. &#8211; The following acts shall constitute access device fraud and are hereby declared to be unlawful:\n(a) producing, using, trafficking in one or more counterfeit access devices;\n(b) trafficking in one or more unauthorized access devices or access devices fraudulently applied for;\n(c) using, with intent to defraud, an unauthorized access device;\n(d) using an access device fraudulently applied for;\n(e) possessing one or more counterfeit access devices or access devices fraudulently applied for;\n(f) producing, trafficking in, having control or custody of, or possessing device-making or altering equipment without being in the business or employment, which lawfully deals with the manufacture, issuance, or distribution of such equipment;\n(g) inducing, enticing, permitting or in any manner allowing another, for consideration or otherwise to produce, use, traffic in counterfeit access devices, unauthorized access devices or access devices fraudulently applied for;\n(h) multiple imprinting on more than one transaction record, sales slip or similar document, thereby making it appear that the device holder has entered into a transaction other than those which said device holder had lawfully contracted for, or submitting, without being an affiliated merchant, an order to collect from the issuer of the access device, such extra sales slip through an affiliated merchant who connives therewith, or, under false pretenses of being an affiliated merchant, present for collection such sales slips, and similar documents;\n(i) disclosing any information imprinted on the access device, such as, but not limited to, the account number or name or address of the device holder, without the latter's authority or permission;\n(j) obtaining money or anything of value through the use of an access device, with intent to defraud or with intent to gain and fleeing thereafter;\n(k) having in one's possession, without authority from the owner of the access device or the access device company, an access device, or any material, such as slips, carbon paper, or any other medium, on which the access device is written, printed, embossed, or otherwise indicated;\n(l) writing or causing to be written on sales slips, approval numbers from the issuer of the access device of the fact of approval, where in fact no such approval was given, or where, if given, what is written is deliberately different from the approval actually given;\n(m) making any alteration, without the access device holder's authority, of any amount or other information written on the sales slip;\n(n) effecting transaction, with one or more access devices issued to another person or persons, to receive payment or any other thing of value;\n(o) without the authorization of the issuer of the access device, soliciting a person for the purpose of:\n1) offering an access device; or\n2) selling information regarding or an application to obtain an access device; or\n(p) without the authorization of the credit card system member or its agent, causing or arranging for another person to present to the member or its agent, for payment, one or more evidence or records of transactions made by credit card."
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Penalties",
      "content": "Section 10. Penalties. &#8211; Any person committing any of the acts constituting access device fraud enumerated in the immediately preceding section shall be punished with:\n(a) a fine of Ten thousand pesos (P10,000.00) or twice the value obtained by the offense, whichever is greater and imprisonment for not less than six (6) years and not more than ten (10) years, in the case of an offense under Section 9 (b)-(e), and (g)-(p) which does not occur after a conviction for another offense under Section 9;\n(b) a fine of Ten thousand pesos (P10,000.00) or twice the value obtained by the offense, and imprisonment for not less than ten (10) years and for not more than twelve (12) years, in the case of an offense under Section 9 (a), and (f) of the foregoing section, which does not occur after a conviction for another offense under Section 9; and\n(c) a fine of Ten thousand pesos (P10,000.00) or twice the value obtained by the offense, or imprisonment for not less than twelve (12) years and not more than twenty (20) years, or both, in the case of any offense under Section 9, which occurs after a conviction for another offense under said subsection, or an attempt to commit the same."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Conspiracy to commit access device fraud",
      "content": "Section 11. Conspiracy to commit access device fraud. &#8211; If two (2) or more persons conspire to commit any of the offenses listed in Section 9 and one or more of such persons does any act to effect the object of the conspiracy, each of the parties to such conspiracy shall be punished as in the case of the doing of the act, the accomplishment of which is the object of such conspiracy."
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Frustrated and attempted access device fraud",
      "content": "Section 12. Frustrated and attempted access device fraud. &#8211; Any person who performs all the acts of execution which would produce any of the unlawful acts enumerated in Section 9 of this Act, but which nevertheless does not produce it by reason of causes independent of the will of said person, shall be punished with two-thirds (2/3) of the fine and imprisonment provided for the consummated offenses listed in said section. Any person who commences the commission of any of the unlawful acts enumerated in Section 9 of this Act directly by overt acts and does not perform all the acts of execution which would produce the said acts by reason of some cause or accident other than said person's own spontaneous desistance, shall be punished with one-half (1/2) of the fine and imprisonment provided for the consummated offenses listed in the said section."
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Accessory to access device fraud",
      "content": "Section 13. Accessory to access device fraud. &#8211; Any person who, with intent to gain for himself or for another, buy, receives, possesses, keeps, acquires, conceals, sells, or disposes of, shall buy and sell, or in any manner deal in any article, item, object or anything of value which he knows or should be known to him, to have been acquired through the use of counterfeit access device or an unauthorized access device or an access device known to him to have been fraudulently applied for, shall be considered as an accessory to an access device fraud and shall be punished with one-half (1/2) of the fine and imprisonment provided for the applicable consummated offenses listed in Section 9 of this Act. Said person shall be prosecuted under this Act or under the Anti-Fencing Law of 1979 (Presidential Decree No. 1612) whichever imposes the longer prison term as penalty for the consummated offense."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Presumption and prima facie evidence of intent to defraud",
      "content": "Section 14. Presumption and prima facie evidence of intent to defraud. &#8211; The mere possession, control or custody of:\n(a) an access device, without permission of the owner or without any lawful authority;\n(b) a counterfeit access device;\n(c) access device fraudulently applied for;\n(d) any device-making or altering equipment by any person whose business or employment does not lawfully deal with the manufacture, issuance, or distribution of access device;\n(e) an access device or medium on which an access device is written, not in the ordinary course of the possessor's trade or business; or\n(f) a genuine access device, not in the name of the possessor, or not in the ordinary course of the possessor's trade or business, shall be prima facie evidence that such device or equipment is intended to be used to defraud.\nA cardholder who abandons or surreptitiously leaves the place of employment, business or residence stated in his application or credit card, without informing the credit card company of the place where he could actually be found, if at the time of such abandonment or surreptitious leaving, the outstanding and unpaid balance is past due for at least ninety (90) days and is more than Ten thousand pesos (P10,000.00), shall be prima facie presumed to have used his credit card with intent to defraud."
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Loss of access devices",
      "content": "Section 15. Loss of access devices. &#8211; In case of loss of an access device, the holder thereof must notify the issuer of the access device of the details and circumstances of such loss upon knowledge of the loss. Full compliance with such procedure would absolve the access device holder of any financial liability from fraudulent use of the access device from the time the loss or theft is reported to the issuer."
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Reporting requirements",
      "content": "Section 16. Reporting requirements. &#8211; All companies engaged in the business of issuing access devices, including banks, financing companies and other financial institutions issuing access devices, shall furnish annually, on or before the 31st of March of the succeeding year, a report to the Credit Card Association of the Philippines regarding access device frauds committed against the holders of such entities in the preceding calendar year, for consolidation and submission to the National Bureau of Investigation.\nNotwithstanding this requirement, banks, financing companies and other financial institutions, including their subsidiaries and affiliates, issuing access devices shall continue to be regulated and supervised by the Bangko Sentral ng Pilipinas while other companies issuing access devices shall continue to be regulated and supervised by the Securities and Exchange Commission."
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Liability under the Revised Penal Code and other laws",
      "content": "Section 17. Liability under the Revised Penal Code and other laws. &#8211; Prosecution under this Act shall be without prejudice to any liability for violation of any provision of the Revised Penal Code or any other law."
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Separability clause",
      "content": "Section 18. Separability clause. &#8211; If any separable provision of this Act be declared unconstitutional, the remaining provisions shall continue to be in force."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Repealing clause",
      "content": "Section 19. Repealing clause. &#8211; Any law, presidential decree or issuance, executive order, letter of instruction, administrative order, rule or regulation contrary to, or inconsistent with, the provisions of this Act is hereby repealed, modified or amended accordingly."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Effectivity clause",
      "content": "Section 20. Effectivity clause. &#8211; This Act shall take effect fifteen (15) days after its publication in at least two (2) newspapers of general circulation.\nApproved: February 11, 1998\nThe Lawphil Project - Arellano Law Foundation"
    }
  ],
  "definitions": []
}